package ch15Data_Structure_Collection_Framework;

/*<컬렉션 자료구조>
 * 
 * 컬력션은 모음을 뜻한다. 무엇을 모은다는 것일까? 객체이다. 객체를 저장할수 있는 자료 구조이다.
 * 베열도 객체를 저장한다.
 * 
 * 예로
 * Member[] member = new Member[10]; 이런식으로 만들수 있다.
 * member[0] = new Member();
 * member[1] = new Member(); 이런식으로 객체를 생성해서 저장 할수 있다.
 * 
 * 배열도 하나의 자료구조이다. 배열의 특징은 2가지가 있다.
 * 
 * 1.같은 타입만 저장 가능하다.
 * 2.길이를 변경할수 없다.
 * 
 * 만약 길이가 10 짜리 배여을 쓰다가 11개 짜리 배열을 사용하려면
 * 배열을 복사해서 새로운 배열을 만들고 거기에 복사를 해야한다.
 * 
 * 15장의 컬랙션의 경우 배열과 유사한데
 */
public class Collection {

}
